In [144]:
%matplotlib inline
import pandas as pd

In [145]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

FileNotFoundError: [Errno 2] No such file or directory: 'style-table.css'

In [146]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [147]:
import numpy as np

In [148]:
titles = pd.read_csv('titles.csv')

In [149]:
result = titles.shape
print(result)

(244914, 2)

In [150]:
len(titles)

244914

### What are the earliest two films listed in the titles dataframe?

In [151]:
df2  = titles.head(2)

In [152]:
df2

                title  year
0  Tasveer Mere Sanam  1996
1            Only You  1994

### How many movies have the title "Hamlet"?

In [153]:

import matplotlib.pyplot as plt

In [154]:
import seaborn as sns

In [155]:
%matplotlib inline

In [156]:
titles['title'].value_counts()

Hamlet                    20
Carmen                    17
Macbeth                   16
Maya                      12
The Outsider              12
                          ..
Music Hath Charms          1
Miao miao                  1
Around Every Corner        1
Los lios de Barba Azul     1
Juzni vetar                1
Name: title, Length: 223828, dtype: int64

In [157]:
Hamlet = titles.title.value_counts()['Hamlet']
Hamlet

20

### How many movies are titled "North by Northwest"?

In [158]:
 NorthbyNorthwest = titles.title.value_counts()['North by Northwest']

In [159]:
NorthbyNorthwest

1

### When was the first movie titled "Hamlet" made?

In [160]:
Hamletyear = titles[titles.title == 'Hamlet'].sort_values('year').head(1)

In [161]:
Hamletyear

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [162]:
titles[titles.title == 'Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [163]:
titles[(titles['year'] >= 1950)].shape[0]

209933

### How many movies were made in the year 1960?

In [164]:
titles[(titles['year'] >= 1960)].shape[0]

196999

### How many movies were made from 1950 through 1959?

In [165]:
titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)].shape[0]

12934

### In what years has a movie titled "Batman" been released?

In [166]:
release_dates = pd.read_csv('release_dates.csv')

In [167]:
release_dates.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

In [168]:
release_dates[release_dates.title == 'Batman'].sort_values('year')

        title  year         country        date
39316  Batman  1943             USA  1943-07-16
39317  Batman  1943          Mexico  1946-11-01
39318  Batman  1943        Portugal  1950-05-29
39319  Batman  1943    West Germany  1966-06-19
39336  Batman  1989    West Germany  1989-10-26
39337  Batman  1989          Greece  1989-10-27
39338  Batman  1989       Hong Kong  1989-11-02
39339  Batman  1989      Yugoslavia  1989-11-21
39340  Batman  1989        Colombia  1989-11-23
39342  Batman  1989         Hungary  1989-12-21
39335  Batman  1989          Brazil  1989-10-26
39343  Batman  1989           Japan  1989-12-23
39344  Batman  1989         Uruguay  1989-12-25
39345  Batman  1989          Poland  1989-12-31
39346  Batman  1989           India  1990-03-13
39341  Batman  1989       Argentina  1989-12-14
39334  Batman  1989          Sweden  1989-10-20
39332  Batman  1989         Finland  1989-10-20
39347  Batman  1989     South Korea  1990-07-07
39331  Batman  1989          Taiwan  1989-10-07
39330  Batman  1989          Norway  1989-10-05
39329  Batman  1989           Spain  1989-09-29
39328  Batman  1989        Portugal  1989-09-29
39327  Batman  1989     Netherlands  1989-09-29
39326  Batman  1989         Denmark  1989-09-29
39325  Batman  1989          France  1989-09-13
39324  Batman  1989         Belgium  1989-09-13
39323  Batman  1989       Australia  1989-08-31
39322  Batman  1989              UK  1989-08-11
39321  Batman  1989         Ireland  1989-08-11
39320  Batman  1989             USA  1989-06-23
39333  Batman  1989           Italy  1989-10-20
39348  Batman  1989  Czechoslovakia  1992-05-01

### How many roles were there in the movie "Inception"?

In [169]:
cast = pd.read_csv('cast.csv')

In [170]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [171]:
len(cast[(cast.title == 'Inception')].character)

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [114]:
total_num1 = cast['character'][(cast.title == 'Inception')& (cast['n'].isnull())]

In [115]:
print(len(total_num1))

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [116]:
total_num = cast['character'][(cast.title == 'Inception')& (cast['n'].notnull())]

In [117]:
total_num

149008       Fischer's Jet Captain
183937                    Browning
260128              Bridge Sub Con
326745                       Miles
333415            Elderly Bald Man
433867              Bridge Sub Con
444385                 Bar Sub Con
517227              Bridge Sub Con
590576                        Cobb
709436                  Cab Driver
737322             Penrose Sub Con
807795         Immigration Officer
812135             James (3 years)
832083               Lobby Sub Con
833376                    Old Cobb
859993                      Arthur
910757                        Nash
940923                       Eames
967176                      Lawyer
1170785                   Thin Man
1309851                    Tadashi
1455534    Japanese Security Guard
1615709             Robert Fischer
1618527                Bar Sub Con
1668790          James (20 months)
1701902          Saito's Attendant
1812091                Businessman
1826027            Maurice Fischer
1861317              Lobby Sub Con
1876301                      Yusuf
2049179                Businessman
2250605           Fischer's Driver
2267383                Bar Sub Con
2406531                      Saito
2614557                Bar Sub Con
2765969                        Mal
2776554            Penrose Sub Con
2807441             Bridge Sub Con
2932657         Phillipa (3 years)
2932664         Phillipa (5 years)
3151982             Bridge Sub Con
3158892            Penrose Sub Con
3203564              Lobby Sub Con
3225843              Lobby Sub Con
3343512                Bar Sub Con
3359825           Flight Attendant
3387147                    Ariadne
3444628              Lobby Sub Con
3473041              Private Nurse
3480170                     Blonde
3731263                    Old Mal
Name: character, dtype: object

In [118]:
print(len(total_num))

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [119]:
total_num1 = cast[(cast.title == 'North by Northwest')].sort_values('n')

In [120]:
total_num1

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
...,...,...,...,...,...,...
3441077,North by Northwest,1959,Maudie Prickett,actress,Elsie - Maid,NaN
3577128,North by Northwest,1959,Doris Singh,actress,First United Nations Receptionist,NaN
3599912,North by Northwest,1959,Helen Spring,actress,Bidder,NaN
3739133,North by Northwest,1959,Susan Whitney,actress,Attendant,NaN
3751311,North by Northwest,1959,Paula Winslowe,actress,Woman at Auction,NaN

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [129]:
total_num1 = cast[(cast.title == 'Sleuth')& (cast.year == 1972)].sort_values('n')

In [130]:
total_num1

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [ ]:
total_num1 = cast[(cast.title == 'Sleuth')& (cast.year == 2007)].sort_values('n')

In [131]:
total_num1

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [60]:
total_num = cast['character'][(cast.title == 'Hamlet') & (cast.year <= 1921)]

In [61]:
print(len(total_num))

37

### How many roles were credited in Branagh’s 1996 Hamlet?

In [142]:
total_num = cast[(cast.name== 'Branagh')&(cast.character == 'Hamlet') & (cast.year == 1996)]

In [143]:
print(len(total_num))

0

### How many "Hamlet" roles have been listed in all film credits through history?

In [74]:
Hamlet_list = cast[cast.character == 'Hamlet'].sort_values('title')

In [75]:
print(len(Hamlet_list))

96

### How many people have played an "Ophelia"?

In [72]:
ophelia_list = cast[cast.character == 'Ophelia'].sort_values('name')

In [73]:
print(len(ophelia_list))

117

### How many people have played a role called "The Dude"?

In [79]:
Dude_list = cast[cast.character == 'The Dude'].sort_values('name')

In [80]:
print(len(Dude_list))

19

### How many people have played a role called "The Stranger"?

In [172]:
Stranger_list = cast[cast.character == 'The Stranger'].sort_values('name')

In [173]:
print(len(Stranger_list))

212

### How many roles has Sidney Poitier played throughout his career?

In [174]:
Poitier_list = cast[cast.name == 'Sidney Poitier'].sort_values('character')

In [175]:
print(len(Poitier_list))

43

### How many roles has Judi Dench played?

In [176]:
judi_list = cast[cast.name == 'Judi Dench'].sort_values('character')

In [177]:
print(len(judi_list))

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [178]:
total_num = cast['character'][(cast.name == 'Cary Grant') & (cast.n == 2) & (cast.year>=1940)&(cast.year<1950)]

In [179]:
total_num.head()

871423     Nick Arden
871433    Roger Adams
Name: character, dtype: object

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [180]:
total_num = cast['character'][(cast.name == 'Cary Grant') & (cast.n == 1) & (cast.year>=1940)&(cast.year<1950)]

In [181]:
total_num

871390                       Mortimer Brewster
871398                           Capt. Cassidy
871402                       Dr. Madison Brown
871407                            Walter Burns
871411                   Captain Henri Rochard
871421                           Jim Blandings
871422    Joe Adams -posing as Joe Bascopolous
871424                             Cole Porter
871425                              Ernie Mott
871427                                  Devlin
871429                   Patrick 'Pat' O'Toole
871430                             Jerry Flynn
871438                        Johnnie Aysgarth
871444                             Dick Nugent
871445                                  Dudley
871448                             Matt Howard
871450                      C. K. Dexter Haven
871452                            Leopold Dilg
Name: character, dtype: object

### How many roles were available for actors in the 1950s?

In [182]:
x = cast[(cast.type == 'actor') & (cast.year>=1950)&(cast.year<1960)].character

In [183]:
print(len(x))

157738

### How many roles were available for actresses in the 1950s?

In [184]:
y = cast[(cast.type == 'actress') & (cast.year>=1950) & (cast.year<1960)].character

In [185]:
print(len(y))

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [186]:
total_num = cast['character'][(cast.n == 1) & (cast.year <= 1980)]

In [187]:
print(len(total_num))

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [188]:
total_num = cast['character'][(cast.n == 2) & (cast.year<= 1980)]

In [189]:
print(len(total_num))

61395

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [190]:
total_num = cast['character'][((cast.n!=1) | (cast.n!=2)) & (cast.year <=1980)]

In [191]:
print(total_num)

20         Nigth Club Owner
26                  Bailaor
28                  Cantaor
35                  Himself
36                  Himself
                 ...
3786088               Aynur
3786092             Hemsire
3786094               Maria
3786095      Alev'in Annesi
3786096    Seferoglu Rukiye
Name: character, Length: 1182807, dtype: object

In [192]:
print(len(total_num))

1182807